---
kind: other
id: Properties.T:Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs
source: html/522db575-468e-0177-23f0-f3c275f4edde.htm
---
# TextBoxEnterPressedEventArgs Properties

The current UIApplication.